tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "wez/wezterm"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# App to build and share containerized applications and microservices
cask "docker"
# Neovim Client
cask "neovide"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
