tap "homebrew/bundle"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "oven-sh/bun"
tap "wez/wezterm"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Utility-first CSS framework
brew "tailwindcss"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Replacement for Docker Desktop
cask "orbstack"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "Xcode", id: 497799835
